{
  "id": "trello",
  "displayName": "Trello",
  "description": "A web-based, kanban-style, list-making application.",
  "createdAt": "2026-01-16T07:19:09.295Z",
  "links": {
    "homepage": "",
    "registry": "https://smithery.ai/server/trello"
  },
  "connection": {
    "type": "http",
    "runtime": "node",
    "configSchema": {}
  },
  "capabilities": [
    {
      "name": "TRELLO_ADD_BOARDS",
      "description": "Creates a new Trello board; the 'name' parameter is required for creation, and various preferences can be customized or cloned from a source board."
    },
    {
      "name": "TRELLO_ADD_BOARDS_CALENDAR_KEY_GENERATE_BY_ID_BOARD",
      "description": "Generates a new calendar key for the Trello board specified by `idBoard`, invalidating any previous key for that board."
    },
    {
      "name": "TRELLO_ADD_BOARDS_CHECKLISTS_BY_ID_BOARD",
      "description": "Creates a new, initially empty checklist with a given name on an existing Trello card. Checklists are created on cards, not boards."
    },
    {
      "name": "TRELLO_ADD_BOARDS_EMAIL_KEY_GENERATE_BY_ID_BOARD",
      "description": "Generates a new email key for the Trello board specified by idBoard to enable or reset adding cards via email; this invalidates any previously existing email key for the board."
    },
    {
      "name": "TRELLO_ADD_BOARDS_LABELS_BY_ID_BOARD",
      "description": "Creates a new label on an existing Trello board."
    },
    {
      "name": "TRELLO_ADD_BOARDS_LISTS_BY_ID_BOARD",
      "description": "Creates a new, empty list on a specified, existing Trello board, typically used as a column or category for organizing cards."
    },
    {
      "name": "TRELLO_ADD_BOARDS_MARK_AS_VIEWED_BY_ID_BOARD",
      "description": "Marks the Trello board specified by idBoard as viewed for the current user, exclusively updating its viewed status and potentially influencing its position in user-specific lists and notification settings."
    },
    {
      "name": "TRELLO_ADD_BOARDS_POWER_UPS_BY_ID_BOARD",
      "description": "Enables the Power-Up specified by the 'value' parameter on the board; processes one Power-Up enablement per call."
    },
    {
      "name": "TRELLO_ADD_CARDS",
      "description": "Creates a new card in a Trello list; `idList` is required, and if `idCardSource` is used, the source card must be accessible."
    },
    {
      "name": "TRELLO_ADD_CARDS_ACTIONS_COMMENTS_BY_ID_CARD",
      "description": "Adds a new text comment, which can include @mentions, to a Trello card specified by its ID; file attachments are not supported via this action."
    },
    {
      "name": "TRELLO_ADD_CARDS_ATTACHMENTS_BY_ID_CARD",
      "description": "Adds an attachment to a Trello card by `idCard`; specify either a `file` to upload or a `url` to link, but not both."
    },
    {
      "name": "TRELLO_ADD_CARDS_CHECKLIST_CHECK_ITEM_BY_ID_CARD_BY_ID_CHECKLIST",
      "description": "Adds a new check item to an existing checklist on a specific Trello card."
    },
    {
      "name": "TRELLO_ADD_CARDS_CHECKLISTS_BY_ID_CARD",
      "description": "Adds a checklist to a Trello card: use `value` to add a specific existing checklist, `idChecklistSource` to create a new checklist by copying an existing one (optionally using `name` for the new checklist's name), or `name` to create a new empty checklist from scratch."
    },
    {
      "name": "TRELLO_ADD_CARDS_ID_LABELS_BY_ID_CARD",
      "description": "Adds an existing label to a Trello card; `idCard` identifies the card and `value` is the ID of the label to add. Both card and label must already exist."
    },
    {
      "name": "TRELLO_ADD_CARDS_ID_MEMBERS_BY_ID_CARD",
      "description": "Assigns a Trello member to a specific Trello card by card ID (or short link) and member ID."
    },
    {
      "name": "TRELLO_ADD_CARDS_LABELS_BY_ID_CARD",
      "description": "Adds a label to an existing Trello card (specified by `idCard`), defining the label by `name` and either `color` or the overriding `value` (which specifies color by name); a new label is created on the board if a matching one (by name/color combination) doesn't already exist."
    },
    {
      "name": "TRELLO_ADD_CARDS_MEMBERS_VOTED_BY_ID_CARD",
      "description": "Casts a 'yes' vote for a specified member on a Trello card; a member can only vote once per card."
    },
    {
      "name": "TRELLO_ADD_CARDS_STICKERS_BY_ID_CARD",
      "description": "Adds a sticker to a Trello card, using a default sticker name (e.g., 'taco-cool') or a custom sticker ID for the image, and allows specifying its position, rotation, and z-index."
    },
    {
      "name": "TRELLO_ADD_CHECKLISTS",
      "description": "Creates a new checklist on a Trello card, either by name or by copying from `idChecklistSource`, targeting an `idCard` or `idBoard`; this action creates only the checklist structure, not its items."
    },
    {
      "name": "TRELLO_ADD_CHECKLISTS_CHECK_ITEMS_BY_ID_CHECKLIST",
      "description": "Adds a new check item to a specified Trello checklist; this action does not update existing check items."
    },
    {
      "name": "TRELLO_ADD_LABELS",
      "description": "Creates a new label with a specified name (required) and color on a Trello board (idBoard required); this action defines the label but does not apply it to cards."
    },
    {
      "name": "TRELLO_ADD_LISTS",
      "description": "Creates a new list on a specified Trello board, with options to copy an existing list, set its position, initial state (archived/subscribed), and does not modify existing lists or move cards."
    },
    {
      "name": "TRELLO_ADD_LISTS_ARCHIVE_ALL_CARDS_BY_ID_LIST",
      "description": "Archives all cards in a Trello list; while cards can be restored via the Trello interface, this action does not provide an unarchive function."
    },
    {
      "name": "TRELLO_ADD_LISTS_CARDS_BY_ID_LIST",
      "description": "Creates a new card in a Trello list, which must be specified by an existing and accessible `idList`."
    },
    {
      "name": "TRELLO_ADD_LISTS_MOVE_ALL_CARDS_BY_ID_LIST",
      "description": "Moves all cards from a Trello list to a *different* board; this action is irreversible, moves (not copies) cards, and empties the source list without deleting it."
    },
    {
      "name": "TRELLO_ADD_MEMBERS_AVATAR_BY_ID_MEMBER",
      "description": "Updates a Trello member's avatar using a base64-encoded image; the `file` field, though schema-optional, requires valid image data for a successful update."
    },
    {
      "name": "TRELLO_ADD_MEMBERS_BOARD_BACKGROUNDS_BY_ID_MEMBER",
      "description": "Adds a new custom board background, from an image file, to a specified Trello member's collection, making it available for their use but not applying it to any board."
    },
    {
      "name": "TRELLO_ADD_MEMBERS_BOARD_STARS_BY_ID_MEMBER",
      "description": "Stars a Trello board for a member (does not remove or list stars), optionally at a specified position; the board must exist and be accessible to the member."
    },
    {
      "name": "TRELLO_ADD_MEMBERS_CUSTOM_BOARD_BACKGROUNDS_BY_ID_MEMBER",
      "description": "Adds a new custom board background for a specified Trello member; the `file` parameter (image data) is required."
    },
    {
      "name": "TRELLO_ADD_MEMBERS_CUSTOM_EMOJI_BY_ID_MEMBER",
      "description": "Adds a new custom emoji using an image file and a unique name to a Trello member's account; this emoji is member-specific and not shared across the workspace."
    },
    {
      "name": "TRELLO_ADD_MEMBERS_CUSTOM_STICKERS_BY_ID_MEMBER",
      "description": "Uploads a custom sticker to a Trello member's collection, if the member's plan allows custom stickers and respects associated limits."
    },
    {
      "name": "TRELLO_ADD_MEMBERS_SAVED_SEARCHES_BY_ID_MEMBER",
      "description": "Creates a new saved search with a specified name, position, and query for a Trello member."
    },
    {
      "name": "TRELLO_ADD_NOTIFICATIONS_ALL_READ",
      "description": "Marks all Trello notifications for the authenticated user as read across all boards; this action is permanent and cannot be undone."
    },
    {
      "name": "TRELLO_ADD_ORGANIZATIONS",
      "description": "Creates a new Trello organization (Workspace) with a `displayName` (required), and optionally a description, website, and various preferences (e.g., board visibility, member invitation restrictions)."
    },
    {
      "name": "TRELLO_ADD_ORGANIZATIONS_LOGO_BY_ID_ORG",
      "description": "Sets or updates the logo for a Trello organization; the provided image file must adhere to Trello's format and size restrictions."
    },
    {
      "name": "TRELLO_ADD_SESSIONS",
      "description": "Creates or updates a Trello user session, optionally linking it to a specific board for status updates and setting the user's activity status."
    },
    {
      "name": "TRELLO_ADD_TOKENS_WEBHOOKS_BY_TOKEN",
      "description": "Creates a webhook for a Trello token to monitor a Trello model (`idModel`) and send notifications to a `callbackURL`, which must be publicly accessible and able to respond to Trello's HEAD validation request."
    },
    {
      "name": "TRELLO_CONVERT_CHECKLIST_ITEM_TO_CARD",
      "description": "Converts a checklist item into a new card (useful for promoting a subtask), which inherits some properties from the item; this is irreversible via the API and offers no customization during conversion."
    },
    {
      "name": "TRELLO_DELETE_ACTIONS_BY_ID_ACTION",
      "description": "Deletes a specific Trello action, such as a `commentCard`, by its ID; this is an irreversible operation and only applies to deletable action types, as many (especially system-generated) actions cannot be deleted."
    },
    {
      "name": "TRELLO_DELETE_BOARDS_MEMBERS_BY_ID_BOARD_BY_ID_MEMBER",
      "description": "Permanently removes a current member from a Trello board, revoking their access; this action is irreversible."
    },
    {
      "name": "TRELLO_DELETE_BOARDS_POWER_UPS_BY_ID_BOARD_BY_POWER_UP",
      "description": "Disables a Power-Up on a Trello board using the board's ID and the plugin ID of a Power-Up currently enabled on that board; this action is irreversible and may result in data loss."
    },
    {
      "name": "TRELLO_DELETE_CARDS_ACTIONS_COMMENTS_BY_ID_CARD_BY_ID_ACTION",
      "description": "Deletes a specific comment action (identified by `idAction`) from a Trello card (identified by `idCard`); this operation is irreversible and only affects comments."
    },
    {
      "name": "TRELLO_DELETE_CARDS_ATTACHMENTS_BY_ID_CARD_BY_ID_ATTACHMENT",
      "description": "Permanently removes a specified attachment from a Trello card; this action is irreversible and requires that both the card and the attachment exist."
    },
    {
      "name": "TRELLO_DELETE_CARDS_BY_ID_CARD",
      "description": "Permanently deletes an archived Trello card specified by its `idCard`."
    },
    {
      "name": "TRELLO_DELETE_CARDS_CHECKLISTS_BY_ID_CARD_BY_ID_CHECKLIST",
      "description": "Permanently deletes a specific checklist from a Trello card."
    },
    {
      "name": "TRELLO_DELETE_CARDS_ID_LABELS_BY_ID_CARD_BY_ID_LABEL",
      "description": "Removes a specific label from a Trello card; the label itself is not deleted from the board, only its association with the card."
    },
    {
      "name": "TRELLO_DELETE_CARDS_ID_MEMBERS_BY_ID_CARD_BY_ID_MEMBER",
      "description": "Removes a currently assigned member from a Trello card, affecting only the card's member list and not the member's board membership or overall permissions."
    },
    {
      "name": "TRELLO_DELETE_CARDS_LABELS_BY_ID_CARD_BY_COLOR",
      "description": "Permanently removes a specific `color` label from an existing Trello card identified by `idCard`, if the card has that label; this only disassociates the label from the card, not deleting the label definition itself."
    },
    {
      "name": "TRELLO_DELETE_CARDS_MEMBERS_VOTED_BY_ID_CARD_BY_ID_MEMBER",
      "description": "Removes a member's vote from a Trello card; this operation is irreversible and does not confirm if the vote existed prior to removal."
    },
    {
      "name": "TRELLO_DELETE_CARDS_STICKERS_BY_ID_CARD_BY_ID_STICKER",
      "description": "Permanently removes a specific sticker (identified by `idSticker`) from a Trello card (identified by `idCard`)."
    },
    {
      "name": "TRELLO_DELETE_CHECKLIST_ITEM",
      "description": "Permanently deletes a specific check item from a checklist on a Trello card; this operation is irreversible and only affects the specified item, not the entire checklist."
    },
    {
      "name": "TRELLO_DELETE_CHECKLISTS_BY_ID_CHECKLIST",
      "description": "Permanently and irreversibly deletes a Trello checklist and all its items using the `idChecklist`."
    },
    {
      "name": "TRELLO_DELETE_LABELS_BY_ID_LABEL",
      "description": "Permanently deletes an existing label from a Trello board by its ID; this operation is irreversible via the API."
    },
    {
      "name": "TRELLO_DELETE_MEMBER_BOARD_BACKGROUND",
      "description": "Permanently deletes a specific custom board background belonging to the specified Trello member; this operation cannot be undone."
    },
    {
      "name": "TRELLO_DELETE_MEMBER_CUSTOM_STICKER",
      "description": "Deletes a custom sticker from a Trello member's collection; this permanent action is only available for custom stickers within a Trello Workspace on a paid plan."
    },
    {
      "name": "TRELLO_DELETE_MEMBER_SAVED_SEARCH",
      "description": "Permanently deletes a specific saved search for a Trello member, used when the search is outdated or no longer needed."
    },
    {
      "name": "TRELLO_DELETE_MEMBERS_BOARD_STARS_BY_ID_MEMBER_BY_ID_BOARD_STAR",
      "description": "Removes a specific starred board (identified by `idBoardStar`) from a Trello member's (identified by `idMember`) list of favorites; `idBoardStar` must be an existing star for that member."
    },
    {
      "name": "TRELLO_DELETE_ORGANIZATIONS_BY_ID_ORG",
      "description": "Permanently deletes a Trello organization and all its associated data; this action is irreversible and requires caution."
    },
    {
      "name": "TRELLO_DELETE_ORGANIZATIONS_LOGO_BY_ID_ORG",
      "description": "Deletes an existing Trello organization's custom logo, restoring its default and leaving other settings unchanged; if no custom logo exists, it succeeds without effect."
    },
    {
      "name": "TRELLO_DELETE_ORGANIZATIONS_MEMBERS_ALL_BY_ID_ORG_BY_ID_MEMBER",
      "description": "Removes a member entirely from a specific Trello organization, including from all its boards and cards; this action is permanent and does not delete the member's Trello account."
    },
    {
      "name": "TRELLO_DELETE_ORGANIZATIONS_MEMBERS_BY_ID_ORG_BY_ID_MEMBER",
      "description": "Permanently removes a member from a Trello organization by ID, revoking all access to its content; re-invitation is required for renewed access, and this does not delete the member's Trello account."
    },
    {
      "name": "TRELLO_DELETE_ORGANIZATIONS_PREFS_ORG_INVITE_RESTRICT_BY_ID_ORG",
      "description": "Removes a previously set email domain invitation restriction for a Trello organization."
    },
    {
      "name": "TRELLO_DELETE_ORG_ASSOCIATED_DOMAIN",
      "description": "Irreversibly deletes an associated email domain from a Trello organization's preferences to update email domain restrictions for workspace membership; the domain must be currently associated for removal."
    },
    {
      "name": "TRELLO_DELETE_TOKENS_BY_TOKEN",
      "description": "Deletes a specific Trello API token, identified by its value in the path, permanently revoking its access; this action is irreversible and used to invalidate compromised or unneeded tokens."
    },
    {
      "name": "TRELLO_DELETE_TOKENS_WEBHOOKS_BY_TOKEN_BY_ID_WEBHOOK",
      "description": "Deletes an existing webhook, specified by its `idWebhook`, thereby stopping its notifications."
    },
    {
      "name": "TRELLO_DELETE_WEBHOOKS_BY_ID_WEBHOOK",
      "description": "Permanently deletes an existing Trello webhook by its `idWebhook`, an irreversible action that stops future notifications."
    },
    {
      "name": "TRELLO_DISMISS_MEMBER_MESSAGE",
      "description": "Dismisses a specific one-time message for an existing Trello member, preventing it from being displayed again."
    },
    {
      "name": "TRELLO_GET_ACTIONS_BOARD_BY_ID_ACTION",
      "description": "Retrieves details for the Trello board associated with a specific action ID, returning board information only."
    },
    {
      "name": "TRELLO_GET_ACTIONS_BOARD_BY_ID_ACTION_BY_FIELD",
      "description": "Retrieves a specified `field` from the Trello board associated with the provided Trello `idAction`."
    },
    {
      "name": "TRELLO_GET_ACTIONS_BY_ID_ACTION",
      "description": "Retrieves detailed information about a specific Trello action by its ID."
    },
    {
      "name": "TRELLO_GET_ACTIONS_BY_ID_ACTION_BY_FIELD",
      "description": "Retrieves the value of a specific field (e.g., 'data', 'date', 'type') from a Trello action using its unique ID."
    },
    {
      "name": "TRELLO_GET_ACTIONS_CARD_BY_ID_ACTION",
      "description": "Retrieves Trello card details for a given `idAction`, which must be an action specifically linked to a card; returns only card data, not action details."
    },
    {
      "name": "TRELLO_GET_ACTIONS_CARD_BY_ID_ACTION_BY_FIELD",
      "description": "Retrieves a specific field from the Trello card associated with the given action ID."
    },
    {
      "name": "TRELLO_GET_ACTIONS_DISPLAY_BY_ID_ACTION",
      "description": "Retrieves a display-friendly representation of an existing and accessible Trello action for UI/report purposes, providing presentation-focused data instead of full raw details and without altering the action."
    },
    {
      "name": "TRELLO_GET_ACTIONS_ENTITIES_BY_ID_ACTION",
      "description": "Retrieves all entities (e.g., boards, lists, cards, members) associated with a specific, existing Trello action ID."
    },
    {
      "name": "TRELLO_GET_ACTIONS_LIST_BY_ID_ACTION",
      "description": "Retrieves the Trello list associated with a specific Trello action ID, for actions linked to a list."
    },
    {
      "name": "TRELLO_GET_ACTIONS_LIST_BY_ID_ACTION_BY_FIELD",
      "description": "Retrieves a specific field of the list associated with a Trello action, returning only that single field's value."
    },
    {
      "name": "TRELLO_GET_ACTIONS_MEMBER_BY_ID_ACTION",
      "description": "Retrieves specified details of the Trello member who performed the action identified by `idAction`; information is specific to this action's context, not the member's full profile."
    },
    {
      "name": "TRELLO_GET_ACTIONS_MEMBER_BY_ID_ACTION_BY_FIELD",
      "description": "Fetches a specific field of a member for a Trello action, returning only one field per call for optimized data retrieval."
    },
    {
      "name": "TRELLO_GET_ACTIONS_MEMBER_CREATOR_BY_ID_ACTION",
      "description": "Retrieves details about the Trello member who created the action with the given `idAction`."
    },
    {
      "name": "TRELLO_GET_ACTIONS_MEMBER_CREATOR_BY_ID_ACTION_BY_FIELD",
      "description": "Gets information about the creator of a Trello action."
    },
    {
      "name": "TRELLO_GET_ACTIONS_ORGANIZATION_BY_ID_ACTION",
      "description": "Fetches the organization details for a given Trello action, if the action has an associated organization."
    },
    {
      "name": "TRELLO_GET_ACTIONS_ORGANIZATION_BY_ID_ACTION_BY_FIELD",
      "description": "Retrieves the value of a specific `field` for the organization associated with a Trello `idAction`; use if the action has an organization and you need only that field (e.g., 'name', 'id', 'url')."
    },
    {
      "name": "TRELLO_GET_BATCH",
      "description": "Executes multiple Trello API GET requests in a single batch operation for efficient bulk data retrieval."
    },
    {
      "name": "TRELLO_GET_BOARDS_ACTIONS_BY_ID_BOARD",
      "description": "Retrieves actions (e.g., card creations, comments) for a Trello board by its ID, useful for activity tracking; the board must exist."
    },
    {
      "name": "TRELLO_GET_BOARDS_BOARD_STARS_BY_ID_BOARD",
      "description": "Retrieves board stars (user-marked favorites) for a specified Trello board, where `idBoard` must be an existing board; use to list a user's starred boards or all stars on a particular board."
    },
    {
      "name": "TRELLO_GET_BOARDS_BY_ID_BOARD",
      "description": "Fetches comprehensive details for a specific Trello board by its ID; this is a read-only action."
    },
    {
      "name": "TRELLO_GET_BOARDS_BY_ID_BOARD_BY_FIELD",
      "description": "Retrieves the value of a single, specified field from a Trello board."
    },
    {
      "name": "TRELLO_GET_BOARDS_CARDS_BY_ID_BOARD",
      "description": "Retrieves cards from an existing Trello board, allowing filtering and customization of fields for cards, attachments, and members."
    },
    {
      "name": "TRELLO_GET_BOARDS_CARDS_BY_ID_BOARD_BY_FILTER",
      "description": "Retrieves cards from a specified Trello board, filtered by 'all', 'closed', 'none', 'open', or 'visible'."
    },
    {
      "name": "TRELLO_GET_BOARDS_CARDS_BY_ID_BOARD_BY_ID_CARD",
      "description": "Retrieves details for a specific Trello card by its ID and its parent board's ID, with options to customize returned fields for the card and associated data like attachments, actions, members, and checklists."
    },
    {
      "name": "TRELLO_GET_BOARDS_CHECKLISTS_BY_ID_BOARD",
      "description": "Retrieves checklists (primarily structure/metadata, not detailed item history) from a Trello board, with options to include associated card and check item details and to control which fields are returned for each entity."
    },
    {
      "name": "TRELLO_GET_BOARDS_DELTAS_BY_ID_BOARD",
      "description": "Retrieves recent changes (deltas) for a Trello board by its ID, allowing tracking of modifications since a specified update sequence number (`ixLastUpdate`)."
    },
    {
      "name": "TRELLO_GET_BOARDS_LABELS_BY_ID_BOARD",
      "description": "Fetches labels for a specified Trello board, aiding in its organization or label management; this action does not detail per-card label usage."
    },
    {
      "name": "TRELLO_GET_BOARDS_LABELS_BY_ID_BOARD_BY_ID_LABEL",
      "description": "Fetches specified fields for a specific label on a Trello board; this read-only action does not return information about which cards the label is attached to."
    },
    {
      "name": "TRELLO_GET_BOARDS_LISTS_BY_ID_BOARD",
      "description": "Retrieves lists from a specified Trello board, with options to filter lists and include card details."
    },
    {
      "name": "TRELLO_GET_BOARDS_LISTS_BY_ID_BOARD_BY_FILTER",
      "description": "Fetches lists by status from an accessible Trello board; card details for these lists require a separate call."
    },
    {
      "name": "TRELLO_GET_BOARDS_MEMBERS_BY_ID_BOARD",
      "description": "Retrieves members of a Trello board, with options to filter the list and select specific member fields to return."
    },
    {
      "name": "TRELLO_GET_BOARDS_MEMBERS_BY_ID_BOARD_BY_FILTER",
      "description": "Retrieves members of a Trello board using a specified filter, assuming the board exists and the filter is valid."
    },
    {
      "name": "TRELLO_GET_BOARDS_MEMBERS_CARDS_BY_ID_BOARD_BY_ID_MEMBER",
      "description": "Retrieves cards for a member on a board, with options to customize returned fields and related data; member must have board access."
    },
    {
      "name": "TRELLO_GET_BOARDS_MEMBERSHIPS_BY_ID_BOARD",
      "description": "Retrieves Trello board memberships (user roles and permissions) for auditing access or managing collaboration, returning only membership data and not other board content."
    },
    {
      "name": "TRELLO_GET_BOARDS_MEMBERSHIPS_BY_ID_BOARD_BY_ID_MEMBERSHIP",
      "description": "Retrieves a specific membership on a Trello board by its ID, optionally including member details."
    },
    {
      "name": "TRELLO_GET_BOARDS_MEMBERS_INVITED_BY_ID_BOARD",
      "description": "Retrieves a list of members invited to a specific Trello board who have not yet joined."
    },
    {
      "name": "TRELLO_GET_BOARDS_MEMBERS_INVITED_BY_ID_BOARD_BY_FIELD",
      "description": "Retrieves a specific field (e.g., email, username) for members who have been invited to a Trello board but have not yet joined."
    },
    {
      "name": "TRELLO_GET_BOARDS_MY_PREFS_BY_ID_BOARD",
      "description": "Retrieves the authenticated user's preferences for a specific Trello board."
    },
    {
      "name": "TRELLO_GET_BOARDS_ORGANIZATION_BY_ID_BOARD",
      "description": "Fetches information about the Trello Workspace (organization) to which a specific board belongs, returning details for the Workspace only, not the board itself or its content."
    },
    {
      "name": "TRELLO_GET_BOARDS_ORGANIZATION_BY_ID_BOARD_BY_FIELD",
      "description": "Retrieves a specific field from the organization associated with a Trello board, useful for obtaining targeted details without fetching the entire organization object."
    },
    {
      "name": "TRELLO_GET_CARDS_ACTIONS_BY_ID_CARD",
      "description": "Retrieves the history of actions (e.g., comments, updates, moves) for a Trello card specified by `idCard`; the card must exist and very old actions might not be available."
    },
    {
      "name": "TRELLO_GET_CARDS_ATTACHMENTS_BY_ID_CARD",
      "description": "Retrieves attachments for a Trello card."
    },
    {
      "name": "TRELLO_GET_CARDS_ATTACHMENTS_BY_ID_CARD_BY_ID_ATTACHMENT",
      "description": "Retrieves a specific attachment from a Trello card by card ID and attachment ID."
    },
    {
      "name": "TRELLO_GET_CARDS_BOARD_BY_ID_CARD",
      "description": "Fetches detailed information about the Trello board to which a specific, existing, and accessible card belongs, using the card's ID or short link."
    },
    {
      "name": "TRELLO_GET_CARDS_BOARD_BY_ID_CARD_BY_FIELD",
      "description": "Retrieves a specific field from the board associated with a given Trello card."
    },
    {
      "name": "TRELLO_GET_CARDS_BY_ID_CARD",
      "description": "Retrieves a Trello card by its ID or shortlink, with options to include related data like actions, attachments, members, and checklists."
    },
    {
      "name": "TRELLO_GET_CARDS_BY_ID_CARD_BY_FIELD",
      "description": "Retrieves the value of a single, specified field from a Trello card."
    },
    {
      "name": "TRELLO_GET_CARDS_CHECK_ITEM_STATES_BY_ID_CARD",
      "description": "Gets the states (e.g., 'complete', 'incomplete') of checklist items on a Trello card; returns only item states, not full checklist or card details."
    },
    {
      "name": "TRELLO_GET_CARDS_CHECKLISTS_BY_ID_CARD",
      "description": "Retrieves all checklists, including their check items, for a Trello card specified by its ID or shortlink, if the card exists and is accessible."
    },
    {
      "name": "TRELLO_GET_CARDS_CUSTOM_FIELD_ITEMS_BY_ID_CARD",
      "description": "Tool to retrieve a card's customFieldItems array. Use when you need structured metadata from custom fields for automation."
    },
    {
      "name": "TRELLO_GET_CARDS_LIST_BY_ID_CARD",
      "description": "Gets the Trello list to which a specified card (which must exist) belongs."
    },
    {
      "name": "TRELLO_GET_CARDS_LIST_BY_ID_CARD_BY_FIELD",
      "description": "Fetches a specific field from the Trello list that a given card belongs to."
    },
    {
      "name": "TRELLO_GET_CARDS_MEMBERS_BY_ID_CARD",
      "description": "Retrieves members of a Trello card, identified by its ID or shortLink, allowing customization of which member fields are returned."
    },
    {
      "name": "TRELLO_GET_CARDS_MEMBERS_VOTED_BY_ID_CARD",
      "description": "Fetches members who voted on a Trello card; requires an existing card ID, the Voting Power-Up to be active on the board, and members to have voted; returns member details, not vote counts."
    },
    {
      "name": "TRELLO_GET_CARDS_STICKERS_BY_ID_CARD",
      "description": "Retrieves all visual stickers (used for categorization, emphasis, or decoration) from an existing and accessible Trello card; this read-only action does not affect other card elements."
    },
    {
      "name": "TRELLO_GET_CARDS_STICKERS_BY_ID_CARD_BY_ID_STICKER",
      "description": "Call this action to retrieve detailed properties (like image, position, rotation) of a specific sticker on a Trello card."
    },
    {
      "name": "TRELLO_GET_CHECK_ITEM_BY_ID",
      "description": "Retrieves a specific check item from a checklist using the checklist ID and check item ID."
    },
    {
      "name": "TRELLO_GET_CHECKLISTS_BOARD_BY_ID_CHECKLIST",
      "description": "Retrieves the Trello board a specific checklist belongs to, using the checklist ID."
    },
    {
      "name": "TRELLO_GET_CHECKLISTS_BOARD_BY_ID_CHECKLIST_BY_FIELD",
      "description": "Retrieves a specified `field` (e.g., 'name', 'desc') from the Trello board associated with the given `idChecklist`."
    },
    {
      "name": "TRELLO_GET_CHECKLISTS_BY_ID_CHECKLIST",
      "description": "Fetches a Trello checklist by its `idChecklist`, requiring the ID to refer to an existing checklist, and allows specifying which details of the checklist, its cards, and check items are returned."
    },
    {
      "name": "TRELLO_GET_CHECKLISTS_BY_ID_CHECKLIST_BY_FIELD",
      "description": "Retrieves a specific field's value from a Trello checklist by its ID and the field name, without loading the entire checklist object or its items."
    },
    {
      "name": "TRELLO_GET_CHECKLISTS_CARDS_BY_ID_CHECKLIST",
      "description": "Retrieves cards associated with a specific, valid Trello checklist ID, allowing for filtering and customization of card and related entity data fields."
    },
    {
      "name": "TRELLO_GET_CHECKLISTS_CARDS_BY_ID_CHECKLIST_BY_FILTER",
      "description": "Retrieves cards from a specified Trello checklist, filterable by card ID or status (e.g., 'all', 'open'), noting the response is a single card object even if the filter could match multiple cards."
    },
    {
      "name": "TRELLO_GET_CHECKLISTS_CHECK_ITEMS_BY_ID_CHECKLIST",
      "description": "Retrieves check items from an existing Trello checklist, optionally filtering them and specifying which fields to return."
    },
    {
      "name": "TRELLO_GET_LABELS_BOARD_BY_ID_LABEL",
      "description": "Retrieves the Trello board to which a given, valid Trello label ID (`idLabel`) belongs."
    },
    {
      "name": "TRELLO_GET_LABELS_BOARD_BY_ID_LABEL_BY_FIELD",
      "description": "Retrieves a specified `field` (e.g., 'name', 'url') from the Trello board associated with a given `idLabel`."
    },
    {
      "name": "TRELLO_GET_LABELS_BY_ID_LABEL",
      "description": "Retrieves detailed information for a specific Trello label by its ID, allowing selection of specific fields to return."
    },
    {
      "name": "TRELLO_GET_LISTS_ACTIONS_BY_ID_LIST",
      "description": "Retrieves actions (like card movements or comments, newest first) for a Trello list by its ID, to track history or create activity logs."
    },
    {
      "name": "TRELLO_GET_LISTS_BOARD_BY_ID_LIST",
      "description": "Retrieves the board to which a specific Trello list belongs."
    },
    {
      "name": "TRELLO_GET_LISTS_BOARD_BY_ID_LIST_BY_FIELD",
      "description": "Retrieves a specific field (e.g., 'name', 'desc', 'url') from the Trello board associated with a given list ID, useful when the board's ID is not directly known."
    },
    {
      "name": "TRELLO_GET_LISTS_BY_ID_LIST",
      "description": "Retrieves a Trello list by its unique ID, optionally including details for its cards and parent board."
    },
    {
      "name": "TRELLO_GET_LISTS_BY_ID_LIST_BY_FIELD",
      "description": "Fetches the value of a single, specified field from a Trello list."
    },
    {
      "name": "TRELLO_GET_LISTS_CARDS_BY_ID_LIST",
      "description": "Fetches cards from a Trello list by its ID, with options to filter and customize the returned card data."
    },
    {
      "name": "TRELLO_GET_LISTS_CARDS_BY_ID_LIST_BY_FILTER",
      "description": "Retrieves cards from a specific Trello list, filtered by criteria like 'open', 'closed', or 'all'."
    },
    {
      "name": "TRELLO_GET_MEMBER_BOARD_BACKGROUND",
      "description": "Retrieves a specific custom board background for a Trello member, using the member's ID and the board background's ID."
    },
    {
      "name": "TRELLO_GET_MEMBER_CUSTOM_BG",
      "description": "Retrieves metadata (e.g., brightness, URLs, tiling status) for a specific custom board background of a Trello member, not the image file itself."
    },
    {
      "name": "TRELLO_GET_MEMBER_CUSTOM_EMOJI",
      "description": "Retrieves a specific custom emoji by its ID for a Trello member, requiring that both the member and emoji exist and are associated."
    },
    {
      "name": "TRELLO_GET_MEMBER_CUSTOM_STICKER",
      "description": "Retrieves a specific custom sticker by ID for a Trello member; returns only sticker data (not its usage on cards/boards), with optional field selection."
    },
    {
      "name": "TRELLO_GET_MEMBERS_ACTIONS_BY_ID_MEMBER",
      "description": "Retrieves a list of actions for a specified Trello member, allowing filtering by type, date, models, and control over output format and fields."
    },
    {
      "name": "TRELLO_GET_MEMBER_SAVED_SEARCH",
      "description": "Fetches the details of a specific saved search for a Trello member; this does not execute the search."
    },
    {
      "name": "TRELLO_GET_MEMBERS_BOARD_BACKGROUNDS_BY_ID_MEMBER",
      "description": "Fetches the board backgrounds for a specified Trello member."
    },
    {
      "name": "TRELLO_GET_MEMBERS_BOARDS_BY_ID_MEMBER",
      "description": "Retrieves board-level details (not lists/cards) for Trello boards associated with a member ID or username, allowing extensive customization of the returned data."
    },
    {
      "name": "TRELLO_GET_MEMBERS_BOARDS_BY_ID_MEMBER_BY_FILTER",
      "description": "Retrieves a list of boards for a specific Trello member, applying a filter such as 'open', 'starred', or 'all'."
    },
    {
      "name": "TRELLO_GET_MEMBERS_BOARDS_INVITED_BY_ID_MEMBER",
      "description": "Retrieves Trello boards to which a specific member has been invited but has not yet joined."
    },
    {
      "name": "TRELLO_GET_MEMBERS_BOARDS_INVITED_BY_ID_MEMBER_BY_FIELD",
      "description": "Retrieves a specific field from Trello boards to which a member has been invited but not yet joined; returns an empty result for no pending invitations."
    },
    {
      "name": "TRELLO_GET_MEMBERS_BOARD_STARS_BY_ID_MEMBER",
      "description": "Fetches only the boards a specific Trello member has starred, identified by their ID or username."
    },
    {
      "name": "TRELLO_GET_MEMBERS_BOARD_STARS_BY_ID_MEMBER_BY_ID_BOARD_STAR",
      "description": "Retrieves detailed information about a specific board star (a Trello board marked as a favorite) for a given Trello member."
    },
    {
      "name": "TRELLO_GET_MEMBERS_BY_ID_MEMBER",
      "description": "Fetches comprehensive information about a Trello member, specified by ID or username, including profile, activities, boards, cards, notifications, and organization affiliations, with customizable detail levels via filters and field parameters."
    },
    {
      "name": "TRELLO_GET_MEMBERS_BY_ID_MEMBER_BY_FIELD",
      "description": "Efficiently retrieves a specific field (e.g., fullName, username, bio) of a Trello member using their ID or username, without fetching the entire member profile."
    },
    {
      "name": "TRELLO_GET_MEMBERS_CARDS_BY_ID_MEMBER",
      "description": "Retrieves cards for a Trello member, specified by ID or username, with options to filter cards and include related data like actions, attachments, and checklists."
    },
    {
      "name": "TRELLO_GET_MEMBERS_CARDS_BY_ID_MEMBER_BY_FILTER",
      "description": "Retrieves cards for a Trello member, applying a filter that must be a Trello-recognized card filter."
    },
    {
      "name": "TRELLO_GET_MEMBERS_CUSTOM_BOARD_BACKGROUNDS_BY_ID_MEMBER",
      "description": "Retrieves custom board backgrounds for a Trello member, who must exist, using their ID or username."
    },
    {
      "name": "TRELLO_GET_MEMBERS_CUSTOM_EMOJI_BY_ID_MEMBER",
      "description": "Retrieves all custom (user-specific, non-standard) emojis that a specified Trello member has created or can access."
    },
    {
      "name": "TRELLO_GET_MEMBERS_CUSTOM_STICKERS_BY_ID_MEMBER",
      "description": "Retrieves a member's custom stickers, which are unique personalized stickers created by them, distinct from standard Trello stickers."
    },
    {
      "name": "TRELLO_GET_MEMBERS_DELTAS_BY_ID_MEMBER",
      "description": "Retrieves a chronological list of all changes (deltas) made by a specific Trello member, including modifications to boards, lists, and cards, to audit activity or sync data."
    },
    {
      "name": "TRELLO_GET_MEMBERS_NOTIFICATIONS_BY_ID_MEMBER",
      "description": "Retrieves notifications for a Trello member, specified by their ID or username, with options for filtering and pagination."
    },
    {
      "name": "TRELLO_GET_MEMBERS_NOTIFICATIONS_BY_ID_MEMBER_BY_FILTER",
      "description": "Retrieves a list of a Trello member's notifications, filtered by specified types."
    },
    {
      "name": "TRELLO_GET_MEMBERS_ORGANIZATIONS_BY_ID_MEMBER",
      "description": "Fetches organizations a specific Trello member belongs to; the `idMember` must be an ID or username of an existing Trello member."
    },
    {
      "name": "TRELLO_GET_MEMBERS_ORGANIZATIONS_BY_ID_MEMBER_BY_FILTER",
      "description": "Fetches a list of organizations a specific Trello member belongs to, using a filter to narrow down the results."
    },
    {
      "name": "TRELLO_GET_MEMBERS_ORGANIZATIONS_INVITED_BY_ID_MEMBER",
      "description": "Retrieves organizations a Trello member has been invited to but has not yet accepted or declined."
    },
    {
      "name": "TRELLO_GET_MEMBERS_ORGANIZATIONS_INVITED_BY_ID_MEMBER_BY_FIELD",
      "description": "Get a specific field of an organization to which the member has a pending invitation; returns data only if such an invitation exists."
    },
    {
      "name": "TRELLO_GET_MEMBERS_SAVED_SEARCHES_BY_ID_MEMBER",
      "description": "Retrieves all saved search queries for a Trello member; this action only retrieves saved searches and does not execute them."
    },
    {
      "name": "TRELLO_GET_MEMBERS_TOKENS_BY_ID_MEMBER",
      "description": "Gets API token metadata for a Trello member; actual token values are excluded for security."
    },
    {
      "name": "TRELLO_GET_NOTIF_CREATOR_FIELD",
      "description": "Fetches a specific field of the member who created the specified Trello notification."
    },
    {
      "name": "TRELLO_GET_NOTIFICATION_ORG_FIELD",
      "description": "Retrieves a specific field from the Trello organization associated with a given notification, provided the notification is linked to an organization."
    },
    {
      "name": "TRELLO_GET_NOTIFICATIONS_BOARD_BY_ID_NOTIFICATION",
      "description": "Gets the Trello board associated with a given notification ID, returning only board data and allowing selection of specific board fields."
    },
    {
      "name": "TRELLO_GET_NOTIFICATIONS_BOARD_BY_ID_NOTIFICATION_BY_FIELD",
      "description": "Retrieves a specific, valid field from the board associated with a Trello notification."
    },
    {
      "name": "TRELLO_GET_NOTIFICATIONS_BY_ID_NOTIFICATION",
      "description": "Retrieves a specific Trello notification by its ID, optionally including related entities and specific fields for the notification and its related entities."
    },
    {
      "name": "TRELLO_GET_NOTIFICATIONS_BY_ID_NOTIFICATION_BY_FIELD",
      "description": "Retrieves a specific field from a Trello notification."
    },
    {
      "name": "TRELLO_GET_NOTIFICATIONS_CARD_BY_ID_NOTIFICATION",
      "description": "Retrieves card details (excluding notification, board, or list data) for a specified Trello idNotification, which must exist and be linked to a card."
    },
    {
      "name": "TRELLO_GET_NOTIFICATIONS_CARD_BY_ID_NOTIFICATION_BY_FIELD",
      "description": "Retrieves a specific field of a Trello card, using the ID of a notification that is directly associated with that card."
    },
    {
      "name": "TRELLO_GET_NOTIFICATIONS_DISPLAY_BY_ID_NOTIFICATION",
      "description": "Retrieves the information needed to display an existing Trello notification, identified by its ID, without altering the notification or fetching its complete metadata."
    },
    {
      "name": "TRELLO_GET_NOTIFICATIONS_ENTITIES_BY_ID_NOTIFICATION",
      "description": "Retrieves Trello entities (e.g., boards, cards, lists, members) linked to a specific notification ID, focusing on the related entities rather than the notification details itself."
    },
    {
      "name": "TRELLO_GET_NOTIFICATIONS_LIST_BY_ID_NOTIFICATION",
      "description": "Retrieves details of the Trello list associated with a specific notification ID."
    },
    {
      "name": "TRELLO_GET_NOTIFICATIONS_LIST_BY_ID_NOTIFICATION_BY_FIELD",
      "description": "Efficiently retrieves a single specified field from a Trello list linked to a notification, avoiding fetching the entire list."
    },
    {
      "name": "TRELLO_GET_NOTIFICATIONS_MEMBER_BY_ID_NOTIFICATION",
      "description": "Fetches details of the member (not the notification content itself) associated with a specific Trello notification ID."
    },
    {
      "name": "TRELLO_GET_NOTIFICATIONS_MEMBER_BY_ID_NOTIFICATION_BY_FIELD",
      "description": "Retrieves a specific `field` of the Trello member associated with the given `idNotification`."
    },
    {
      "name": "TRELLO_GET_NOTIFICATIONS_MEMBER_CREATOR_BY_ID_NOTIFICATION",
      "description": "Fetches the creator (member) of a Trello notification, identified by `idNotification`, returning only creator details and respecting Trello privacy settings and user permissions."
    },
    {
      "name": "TRELLO_GET_NOTIFICATIONS_ORGANIZATION_BY_ID_NOTIFICATION",
      "description": "Retrieves the Trello organization linked to a specific notification ID; returns organization details only, not the notification itself."
    },
    {
      "name": "TRELLO_GET_ORGANIZATIONS_ACTIONS_BY_ID_ORG",
      "description": "Retrieves a log of actions (e.g., card creations, list movements, comments) for a specified Trello organization, filterable by type, date range, and models; `idOrg` must be a valid organization ID/name, and `page` * `limit` must be < 1000."
    },
    {
      "name": "TRELLO_GET_ORGANIZATIONS_BOARDS_BY_ID_ORG",
      "description": "Fetches boards for a Trello organization, specified by its ID or name, with options to filter and customize returned data."
    },
    {
      "name": "TRELLO_GET_ORGANIZATIONS_BOARDS_BY_ID_ORG_BY_FILTER",
      "description": "Fetches a list of boards belonging to a specific Trello organization, filtered by a given criterion."
    },
    {
      "name": "TRELLO_GET_ORGANIZATIONS_BY_ID_ORG",
      "description": "Retrieves detailed information about a specific Trello organization, including optional related resources like members, boards, and actions, using its ID or unique name."
    },
    {
      "name": "TRELLO_GET_ORGANIZATIONS_BY_ID_ORG_BY_FIELD",
      "description": "Retrieves the value of a single specified `field` for a Trello organization `idOrg`, ideal for efficiently fetching a specific piece of information without loading the full organization details."
    },
    {
      "name": "TRELLO_GET_ORGANIZATIONS_DELTAS_BY_ID_ORG",
      "description": "Retrieves a log of recent modifications (deltas) for a Trello organization, filterable by tags and supporting incremental fetching via an update index."
    },
    {
      "name": "TRELLO_GET_ORGANIZATIONS_MEMBERS_BY_ID_ORG",
      "description": "Retrieves members of a Trello organization (specified by ID or name), with an option to include member activity if the organization is Premium."
    },
    {
      "name": "TRELLO_GET_ORGANIZATIONS_MEMBERS_BY_ID_ORG_BY_FILTER",
      "description": "Fetches members of a specified Trello organization using a filter like 'all', 'normal', 'admins', or 'owners'."
    },
    {
      "name": "TRELLO_GET_ORGANIZATIONS_MEMBERS_CARDS_BY_ID_ORG_BY_ID_MEMBER",
      "description": "Fetches all cards assigned to a specific member of a given Trello organization."
    },
    {
      "name": "TRELLO_GET_ORGANIZATIONS_MEMBERSHIPS_BY_ID_ORG",
      "description": "Fetches organization-level memberships for a Trello organization, with options to filter members and include their details; does not return board-specific memberships."
    },
    {
      "name": "TRELLO_GET_ORGANIZATIONS_MEMBERSHIPS_BY_ID_ORG_BY_ID_MEMBERSHIP",
      "description": "Retrieves a specific membership within a Trello organization, using their respective IDs, to ascertain the member's role, status, or permissions."
    },
    {
      "name": "TRELLO_GET_ORGANIZATIONS_MEMBERS_INVITED_BY_ID_ORG",
      "description": "Retrieves members invited to a Trello organization who have not yet accepted their invitation, returning only data for pending invitations (not active or former members) and cannot send or modify invitations."
    },
    {
      "name": "TRELLO_GET_ORGANIZATIONS_MEMBERS_INVITED_BY_ID_ORG_BY_FIELD",
      "description": "Retrieves a specific `field` (e.g., fullName, username, email, status) for members with pending invitations to the Trello organization specified by `idOrg`."
    },
    {
      "name": "TRELLO_GET_SEARCH",
      "description": "Searches Trello content (e.g., boards, cards, members) within specified organizations using a query and customizable result fields."
    }
  ]
}